---
kind: method
id: M:Autodesk.Revit.DB.ViewDisplaySketchyLines.Dispose
source: html/151a4518-9db3-9415-e5c6-bf56918c4fcc.htm
---
# Autodesk.Revit.DB.ViewDisplaySketchyLines.Dispose Method

Releases all resources used by the ViewDisplaySketchyLines

## Syntax (C#)
```csharp
public void Dispose()
```